#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_app.gateway will be created
  + resource "heroku_app" "gateway" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "gateway-test1-tim7"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = "container"
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_app.servers will be created
  + resource "heroku_app" "servers" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "server-test1-tim7"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = "container"
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_build.gateway will be created
  + resource "heroku_build" "gateway" {
      + app_id            = (known after apply)
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = "SHA256:823052d8e274bd0fc7a3ba45ae95e56a2ef867915f1d1d7a76c58303ba10f25d"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "gateway"
        }
    }

  # heroku_build.servers will be created
  + resource "heroku_build" "servers" {
      + app_id            = (known after apply)
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = "SHA256:8b79780a4645557b4620efe7781573805b639a1e4dc2c072abb6188211abe380"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "servers"
        }
    }

  # heroku_config.gateway will be created
  + resource "heroku_config" "gateway" {
      + id   = (known after apply)
      + vars = {
          + "API_URL" = "server-test1-tim7.herokuapp.com"
        }
    }

  # heroku_config.servers will be created
  + resource "heroku_config" "servers" {
      + id   = (known after apply)
      + vars = {
          + "CORS_ORIGIN" = "https://gateway-test1-tim7.herokuapp.com"
          + "STAGE"       = "PROD"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gateway_app_url = "https://gateway-test1-tim7.herokuapp.com"
  + servers_app_url = "https://server-test1-tim7.herokuapp.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @Andjelaaa, Action: `pull_request`*